
** Code Sample in python

   #+BEGIN_SRC python
     import re
     patt = re.compile("^Subject: (.*)", re.IGNORECASE)
     match = patt.search("Subject: Regarding leave application")
     if match:
         return match.group(1)
   #+END_SRC

   #+RESULTS:
   : Regarding leave application
